Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: To compute views on demand over a dynamic range, use init(_:id:selection:rowContent:).
ja: ビューそれらを必要に応じてある動的範囲にわたって計算するには、init(_:id:selection:rowContent:)を使ってください。

source: To configure the current button style for a view hierarchy, use the buttonStyle(_:) modifier.
ja: 現在のボタンスタイルをあるビュー階層に対して構成設定するには、buttonStyle(_:)修飾子を使ってください。

source: To create a Shape instance, you define the shape’s path using lines and curves.
ja: Shapeインスタンスを作成するには、あなたはその形状のもつパスを、直線と曲線を使って定義します。

source: To create a button with custom interaction behavior, use PrimitiveButtonStyle instead.
ja: ボタンをあつらえの相互作用挙動で作成するには、PrimitiveButtonStyleを代わりに使ってください。

source: To create a button with the standard button interaction behavior defined for each platform, use ButtonStyle instead.
ja: ボタンを標準ボタン相互作用挙動で作成するには、 ButtonStyleを代わりに使ってください。

source: To create a user interface with tabs, place views in a TabView and apply the tabItem(_:) modifier to the contents of each tab.
ja: あるユーザインターフェイスを複数のタブで作成するには、複数のビューをあるTabViewの中において、そしてtabItem(_:)修飾子を各タブの内容に適用してください。

source: To create and configure your custom coordinator, implement the makeCoordinator() method of your NSViewControllerRepresentable object.
ja: あなたのあつらえのコーディネータを作成して構成設定するには、あなたのNSViewControllerRepresentableオブジェクトのmakeCoordinator()メソッドを実装してください。

source: To create this feature, you’ll start by adding a switch to the list so users can focus on just their favorites, and then you’ll add a star-shaped button that a user taps to flag a landmark as a favorite.
ja: この機能を作成するために、あなたはあるスイッチをそのリストに加えることによって始めるでしょう、それでユーザは彼らのお気に入りだけに集中できます、それからあなたは星形ボタンを加えるでしょう、それはユーザがタップしてランドマークにお気に入りとしてフラグを付けるものです。

source: To create your view controller from an archive, override this method and initialize the superclass using the init(coder:rootView:) method instead.
ja: あなたのビューコントローラをアーカイブから作成するには、このメソッドをオーバーライドして、そして代わりにスーパークラスをinit(coder:rootView:)メソッドを使って初期化してください。

source: To customize both appearance and interaction behavior, create a style that conforms to the PrimitiveButtonStyle protocol.
ja: 外観と相互作用挙動の両方をカスタマイズするには、PrimitiveButtonStyleプロトコルに準拠するあるスタイルを作成してください。

source: To declare a new environment key type, specify the Value type and provide a default value; for example:
ja: 新しい環境キー型を宣言するには、Value型を指定して省略時の値を提供してください；例えば：

source: To explicitly bypass localization for a string literal, use the init(verbatim:) initializer.
ja: ある文字列リテラルに対してローカライゼーションを明示的に迂回するには、init(verbatim:)イニシャライザを使ってください。

source: To get the projectedValue, prefix the property variable with $.
ja: projectedValueを取得するには、プロパティ変数に$で接頭辞を付けてください。

source: To give users the ability to change their profile, you’ll add an edit mode and design the preferences screen.
ja: ユーザに彼らのプロファイルを変更する能力を与えるために、あなたは編集モードを加えます、そして環境設定画面を設計します。

source: To initialize a button with a localized string key, use init(_:action:) instead.
ja: ボタンをあるローカライズされた文字列で初期化するには、init(_:action:)を代わりに使います。

source: To initialize a button with a string variable, use init(_:action:) instead.
ja: ボタンを文字列変数で初期化するには、init(_:action:)を代わりに使ってください。

source: To iterate over the elements of a collection with its indices, use the zip(_:_:) function.
ja: あるコレクションの要素すべてにわたってそれのインデックスで反復するには、zip(_:_:)関数を使ってください。

source: To make it easier to track complicated states, use an enumeration that captures all of the states you need to configure your views.
ja: 入り組んだ状態の追跡をより簡単にするために、ある列挙を使ってください、それはあなたのビューを構成設定するのにあなたが必要とする状態の全てをキャプチャするものです。

source: To mark the interface controller as needing an update, call setNeedsBodyUpdate().
ja: インターフェイスコントローラを更新が必要であると印するには、setNeedsBodyUpdate()を呼び出してください。

source: To pass a state property to another view in the view hierarchy, use the variable name with the $ prefix operator.
ja: 状態プロパティをそのビュー階層の中の別のビューに渡すには、変数名を$接頭辞演算子とともに使ってください。

source: To place a border around the outside of this view, apply padding of the same width before adding the border:
ja: 境界線をこのビューの外側を囲むように置くには、同じ幅の詰め物を、境界線を加える前に適用してください。

source: To recognize a drag gesture on a view, create and configure the gesture, and then add it to the view using the gesture(_:including:) modifier.
ja: あるドラッグジェスチャをビュー上で認識するには、そのジェスチャを作成および構成設定して、それからそれをビューにgesture(_:including:)修飾子を使って加えください。

source: To recognize a gesture event on a particular view, create and configure the gesture, and then use the gesture(_:including:) modifier:
ja: あるジェスチャイベントを特定のビュー上で認識するには、そのジェスチャを作成および構成設定して、それからgesture(_:including:)修飾子を使ってください。

source: To recognize a long-press gesture on a view, create and configure the gesture, then add it to the view using the gesture(_:including:) modifier.
ja: ある長押しジェスチャをビュー上で認識するには、そのジェスチャを作成および構成設定して、それからそれをビューにgesture(_:including:)修飾子を使って加えください。

source: To recognize a magnification gesture on a view, create and configure the gesture, and then add it to the view using the gesture(_:including:) modifier.
ja: ある拡大ジェスチャをビュー上で認識するには、そのジェスチャを作成および構成設定して、それからそれをビューにgesture(_:including:)修飾子を使って加えください。

source: To recognize a rotation gesture on a view, create and configure the gesture, and then add it to the view using the gesture(_:including:) modifier.
ja: ある回転ジェスチャをビュー上で認識するには、そのジェスチャを作成および構成設定して、それからそれをビューにgesture(_:including:)修飾子を使って加えください。

source: To recognize a tap gesture on a view, create and configure the gesture, and then add it to the view using the gesture(_:including:) modifier.
ja: あるタップジェスチャをビュー上で認識するには、そのジェスチャを作成および構成設定して、それからそれをビューにgesture(_:including:)修飾子を使って加えください。

source: To recognize when a gesture successfully completes and to retrieve the gesture’s final value, use the onEnded(_:) function to update your app’s state in the callback.
ja: ジェスチャがうまく完了する時に認識するには、そしてジェスチャのもつ最終の値を回収するには、onEnded(_:)関数を使ってあなたのアプリのもつ状態をそのコールバックにおいて更新してください。

source: To retrieve the unscanned remainder of the string, use scanner.string.substring(from: scanner.scanLocation).
ja: 文字列の未スキャンの残りを回収するには、scanner.string.substring(from: scanner.scanLocation)を使ってください。

source: To revert a custom-styled toggle to the default, use toggleStyle(DefaultToggleStyle()).
ja: あるあつらえのスタイルのトグルを初期状態に戻すには、toggleStyle(DefaultToggleStyle())を使ってください。

source: To run on a device, chose your development team in the Signing and Capabilities tab of the target settings.
ja: デバイス上で実行するには、あなたの開発チームをターゲットセッティングのSigning and Capabilitiesタブにおいて選んでください。

source: To set a Scanner object to ignore a set of characters as it scans the string, use the charactersToBeSkipped property.
ja: あるScannerオブジェクトを、それが文字列をスキャンするときある文字集合を無視するように設定するには、charactersToBeSkippedプロパティを使ってください。

source: To set a specific style for all button instances within a view, use the buttonStyle(_:) modifier:
ja: ある特定のスタイルを全てのボタンに対してあるビュー内で設定するには、buttonStyle(_:)修飾子を使ってください：

source: To sort the elements of your sequence in descending order, pass the greater-than operator (>) to the sorted(by:) method.
ja: あなたのシーケンスの要素を降順にソートするには、より大きい演算子（>）をsorted(by:)メソッドに渡してください。

source: To sort your sequence in descending order, pass the greater-than operator (>) as the areInIncreasingOrder parameter.
ja: あなたのシーケンスを降順にソートするには、より大きい演算子（>）をareInIncreasingOrderパラメータとして渡してください。

source: To subclass NSXMLDocument you need to override the primary initializer, init(data:options:), and the methods listed below.
ja: NSXMLDocumentのサブクラスを作るためにあなたは主要イニシャライザ、init(data:options:)、および下で一覧にされるメソッドをオーバーライドしなければなりません。

source: To subclass NSXMLElement you need to override the primary initializer, init(name:uri:), and the methods listed below.
ja: NSXMLElementのサブクラスを作るには、あなたはプライマリイニシャライザ init(name:uri:)、そして下で一覧にされるメソッドをオーバーライドする必要があります。

source: To subclass XMLNode you need to override the primary initializer, init(kind:options:), and the methods listed below.
ja: XMLNodeのサブクラスを作るためにあなたは主要イニシャライザ、init(kind:options:)、および下で一覧にされるメソッドをオーバーライドする必要があります。

source: To track changes to a gesture that shouldn’t reset once the gesture ends, use the onChanged(_:) callback.
ja: 一旦ジェスチャが終わるとしてもリセットすべきでないジェスチャに対して変化を追跡するには、onChanged(_:)コールバックを使ってください。

source: To update a view as a gesture changes, add a GestureState property to your view and update it in the updating(_:body:) callback.
ja: ジェスチャが変化するにつれてビューを更新するには、GestureStateプロパティをあなたのビューに加えてください、そしてそれをupdating(_:body:)コールバックにおいて更新してください。

source: Toggle Styles
ja: トグルスタイル

source: Topics
ja: 話題

source: Touch Bar views may be:
ja: Touch Barビューは、以下であるかもしれません：

source: Traces the outline of this shape with a color or gradient.
ja: この形状の輪郭をある色または勾配でなぞります。

source: Tracking Digital Crown Rotation
ja: デジタルクラウン回転を追跡する

source: Tracking adds space, measured in points, between the characters in the text view.
ja: トラッキングは空間を、ポイントで計って、テキストビューの中の文字の間に加えます。

source: Tracks Digital Crown rotations by updating the specified binding.
ja: 「デジタルクラウン」の回転をこの指定されたバインディングを更新することによって追跡します。

source: Transformed Shapes
ja: 変形された形状

source: Transforming Strings
ja: 文字列を変形する

source: Transforming Values
ja: 値を変換する

source: Transforming a Document Using XSLT
ja: ある書類をXSLTを使って変換する

source: Transforming a Gesture
ja: ジェスチャを変形する

source: Transforms the environment value indicated by a key path with the given function.
ja: あるキーパスによって指し示された環境値をこの与えられた関数によって変換します。

source: Transliteration
ja: 翻字

source: Tree-Based Processing
ja: ツリー基盤の処理

source: Triggering a Button’s Action
ja: ボタンのもつアクションを引き起こす

source: Trims this shape by a fractional amount based on its representation as a path.
ja: この形状をある分量だけ刈り込みます、それの表現に基づいて、あるパスとして。

source: True if the view should be used as the source of geometry for other views in the group.
ja: true、もしビューがそのグループの中の他のビューに対して幾何学のソースとして使われるべきならば。

source: Truncate at the beginning of the line.
ja: 行の冒頭で切り詰めます。

source: Truncate at the end of the line.
ja: 行の末尾で切り詰めます。

source: Truncate in the middle of the line.
ja: 行の真ん中で切り詰めます。

source: Truncation adds an ellipsis (…) to the line when removing text to indicate to readers that text is missing.
ja: 切り詰めは、テキストを取り除いている時に省略記号（…）を行に加えて、テキストが見つからないことを読み手に指し示します。

source: Truncation is indicated by adding an ellipsis (…) to the line when removing text to indicate to readers that text is missing.
ja: 切り詰めは、テキストを取り除いている場合は省略記号（…）を行に加えることによって指し示されることで、読み手にテキストが欠けていることを指し示します。

source: Two elements are incomparable if neither is ordered before the other according to the predicate.
ja: ２つの要素は、述部によるとどちらもが他の前に並べられるならば比較できない。

source: Type Aliases
ja: 型エイリアス

source: Type Method
ja: 型メソッド

source: Type Methods
ja: 型メソッド

source: Type Properties
ja: 型プロパティ

source: Type Property
ja: 型プロパティ

source: Type used to define the kind of document content.
ja: 書類内容の種類を定義するために使われる型。

source: Types conforming to AlignmentID have a corresponding alignment guide value, typically declared as a static constant property of HorizontalAlignment or VerticalAlignment.
ja: AlignmentIDに準拠する型は、ある対応する整列ガイド値を持ちます、概してHorizontalAlignmentまたはVerticalAlignmentの静的定数プロパティとして宣言されます。

source: Types used to identify alignment guides.
ja: 整列ガイドを識別するのに使われる型。

source: UIKit Hosting
ja: UIKitをホストする

source: UIViewControllerRepresentable Implementations
ja: UIViewControllerRepresentable実装

source: UIViewRepresentable Implementations
ja: UIViewRepresentable実装

source: Undo
ja: 取り消し

source: Unless the collection guarantees random-access performance, calculating count can be an O(n) operation.
ja: そのコレクションが無作為アクセス性能を保証しない限り、countの算出は、O(n)演算であるはずです。

source: Unless used in a callback, the XMLParser is a thread-safe class as long as any given instance is only used in one thread.
ja: コールバックにおいて使用したのでない限り、XMLParserはスレッド安全クラスです、なんであれ与えられたインスタンスが１つのスレッドにおいて使われるだけであれば。

source: Update Permanent State During a Gesture
ja: ジェスチャの間に永続する状態を更新する

source: Update Permanent State When a Gesture Ends
ja: ジェスチャが終わる時に永続する状態を更新する

source: Update Transient UI State
ja: 過渡UI状態を更新する

source: Updates the fetched results.
ja: 取って来た結果を更新します。

source: Updates the interface controller's set of views immediately, if updates are pending.
ja: インターフェイスコントローラのもつ一揃いのビューを直ぐに更新します、もし更新が未解決ならば。

source: Updates the presented WatchKit interface object (and its coordinator) to the latest configuration.
ja: 提示されたWatchKitインターフェイスオブジェクト（そしてそれのコーディネータ）を最新の構成設定に更新します。

source: Updates the provided gesture state property as the gesture’s value changes.
ja: 提供されたジェスチャ状態プロパティを、ジェスチャのもつ値が変化するにつれて更新します。

source: Updates the state of the specified view controller with new information from SwiftUI.
ja: 指定されたビューコントローラの状態をSwiftUIからの新しい情報で更新します。

source: Updates the state of the specified view with new information from SwiftUI.
ja: 指定されたビューの状態をSwiftUIからの新しい情報で更新します。

source: Updates the underlying value of the binding.
ja: バインディングの基礎をなす値を更新します。

source: Updates the underlying value of the environment object.
ja: 環境オブジェクトの基礎をなす値を更新します。

source: Updates the underlying value of the gesture state.
ja: ジェスチャ状態の基礎をなす値を更新します。

source: Updates the underlying value of the observed object.
ja: 監視されるオブジェクトの基礎をなす値を更新します。

source: Updates the underlying value of the state.
ja: 状態の基礎をなす値を更新します。

source: Updates the underlying value of the stored value.
ja: その格納値の基礎をなす値を更新します。

source: Updates the value of any dynamic variables prior to populating the view.
ja: あらゆる動的変数をビューに入れるに先立って更新します。

source: Updates the value of the property prior to populating the view.
ja: ビューに投入するに先立ってプロパティの値を更新します。

source: Updating a Gesture's State
ja: ジェスチャのもつ状態を更新する

source: Updating the Root View
ja: ルートビューを更新する

source: Updating the Value
ja: 値を更新する

source: Upper end of the range reported.
ja: 報告される範囲の上側の終わり。

source: Use Section to group different parts of a form’s content.
ja: Sectionを使ってあるフォームのもつ内容の異なる部分をグループにまとめてください。

source: Use ColorPicker to create a color well that your app uses to allow the selection of a Color.
ja: ColorPickerを使って、カラーウェルを作成してください、それはあなたのアプリが使用してdwあるColorの選択をさせるものです。

source: Use touchBar(_:) to provide a static set of views that are displayed by the Touch Bar when appropriate, depending on whether the view has focus.
ja: touchBar(_:)を使って、ビューいくつかからなるある静的集合を提供してください、それは適切な時に、ビューがフォーカスを持つかどうかに依存して、Touch Barによって表示されます。

source: Use accentColor(_:) when you want to apply a broad theme color to your app’s user interface.
ja: accentColor(_:)を使ってください、あなたがある幅広い主題色（ブロードテーマカラー）をあなたのアプリのもつユーザインターフェイスに適用したい時は。

source: Use alignmentGuide(_:computeValue:) to calculate specific offsets to reposition views in relationship to one another.
ja: alignmentGuide(_:computeValue:)を使って、特定のオフセットを計算して、ビューそれらをお互いの関係において再度位置決定してください。

source: Use compositingGroup() to apply effects to a parent view before applying effects to this view.
ja: compositingGroup()を使って、エフェクトを親ビューに適用してください、エフェクトをこのビューに適用する前に。

source: Use contextMenu(_:) to attach a contextual menu struct and its children to the view.
ja: contextMenu(_:)を使って、コンテキストメニューstructおよびそれの子らをビューに添付してください。

source: Use coordinateSpace(name:) to allow another function to find and operate on a view and operate on dimensions relative to that view.
ja: coordinateSpace(name:)を使って、別の関数が、あるビュー上で発見および演算できるようにそしてそのビューに関連する次元それらで演算できるようにしてください。

source: Use disableAutocorrection(_:) when the effect of autocorrection would make it more difficult for the user to input information.
ja: disableAutocorrection(_:)を使ってください、自動修正の効果がユーザとって情報の入力をより困難にする時は。

source: Use edgesIgnoringSafeArea(_:) to change the area proposed for this view so that — were the proposal accepted — this view could extend outside the safe area to the bounds of the screen for the specified edges.
ja: edgesIgnoringSafeArea(_:)を使って、このビューに提案された領域を変更してください、そうすることで — 受諾された提案だった — このビューは、安全領域の外側に画面の境界へとこの指定された縁それらに対して拡張できます。

source: Use multilineTextAlignment(_:) to select an alignment for all of the text in this view or view hierarchy.
ja: multilineTextAlignment(_:)を使って、このビューまたはビュー階層の中のテキストの全てに対する整列を選んでください。

source: Use navigationBarBackButtonHidden(_:) to hide the back button for this view.
ja: navigationBarBackButtonHidden(_:)を使って、戻るボタンをこのビューに対して隠してください。

source: Use navigationBarTitle(_:, displayMode) to set the title of the navigation bar for this view and specify a display mode for the title from one of the NavigationBarItem.Title.DisplayMode styles.
ja: navigationBarTitle(_:, displayMode)を使って、このビューに対するナビゲーションバーのタイトルを設定してください、そしてタイトルの表示モードをNavigationBarItem.Title.DisplayModeスタイルの１つから指定してください。

source: Use projectionEffect(_:) to apply a 3D transformation to the view.
ja: projectionEffect(_:)を使って、3D変形をこのビューに適用してください。

source: Use rotation3DEffect(_:axis:anchor:anchorZ:perspective:) to rotate the view in three dimensions around the given axis of rotation, and optionally, position the view at a custom display order and perspective.
ja: rotation3DEffect(_:axis:anchor:anchorZ:perspective:)を使って、ビューを３次元においてこの与えられた回転軸を中心として回転してください、そして随意に、ビューをあるあつらえの表示順と遠近法に置いてください。

source: Use scaleEffect(_:anchor:) to scale a view by applying a scaling transform of a specific size, specified by scale.
ja: scaleEffect(_:anchor:)を使用して、scaleで指定される、ある特定の大きさの拡大縮小変換を適用することによってビューを拡大縮小してください。

source: Use statusBar(hidden:) to show or hide the status bar.
ja: statusBar(hidden:)を使って、ステータスバーを表示または隠してください。

source: Use touchBar(_:) when you need to dynamically construct items to show in the Touch Bar.
ja: touchBar(_:)を使ってください、あなたが動的にいくつかの項目を組み立ててTouch Barにおいて表示する必要がある場合に。

source: Use touchBarItemPresence(_:) to define the visibility requirements of a particular Touch Bar view during customization by the user.
ja: touchBarItemPresence(_:)を使って、ユーザによるカスタマイズの間における、特定のTouch Barビューの可視的要件を定義してください。

source: Use touchBarItemPrincipal(_:) to designate a view as a significant view in the Touch Bar.
ja: touchBarItemPrincipal(_:)を使って、あるビューをTauch Barにおいて重要なビューとして指定してください。

source: Use Xcode 11 beta.
ja: Xcode 11ベータを使ってください。

source: Use a UIViewControllerRepresentable instance to create and manage a UIViewController object in your SwiftUI interface.
ja: UIViewControllerRepresentableインスタンスを使って、UIViewControllerオブジェクトをあなたのSwiftUIインターフェイスにおいて作成および管理してください。

source: Use a UIViewRepresentable instance to create and manage a UIView object in your SwiftUI interface.
ja: UIViewRepresentableインスタンスを使って、UIViewオブジェクトをあなたのSwiftUIインターフェイスにおいて作成および管理してください。

source: Use a WKInterfaceObjectRepresentable instance to create and manage a WKInterfaceObject in your SwiftUI interface.
ja: WKInterfaceObjectRepresentableインスタンスを使って、WKInterfaceObjectをあなたのSwiftUIインターフェイスにおいて作成および管理してください。

source: Use a binding to create a two-way connection between a property that stores data, and a view that displays and changes the data.
ja: バインディングを使って双方向接続を、データを格納するあるプロパティ、そしてデータを表示および変更するあるビューの間で作成してください。

source: Use a binding to create a two-way connection between a view and its underlying model.
ja: バインディングを使って、ビューとそれの基礎をなすモデルの間の双方向接続を作成してください。

source: Use a transaction to pass an animation between views in a view hierarchy.
ja: トランザクションを使って、アニメーションをあるビュー階層においてビューそれらの間で起こしてください。

source: Use alignment parameters on a parent view to align Text with respect to its parent.
ja: 整列パラメータを親ビュー上で使って、Textをそれの親に関して整列してください。

source: Use an NSViewControllerRepresentable instance to create and manage an NSViewController object in your SwiftUI interface.
ja: NSViewControllerRepresentableインスタンスを使って、NSViewControllerオブジェクトをあなたのSwiftUIインターフェイスにおいて作成および管理してください。

source: Use an NSViewRepresentable instance to create and manage an NSView object in your SwiftUI interface.
ja: NSViewRepresentableインスタンスを使って、NSViewオブジェクトをあなたのSwiftUIインターフェイスにおいて作成および管理してください。

source: Use buttons for any user interface element that triggers actions on press.
ja: 押すことで動作を引き起こすあらゆるユーザインターフェイス要素に対して、ボタンを使ってください。

source: Use contextual menus to add actions that change depending on the user’s current focus and task.
ja: コンテキストによるメニューを使って、ユーザのもつ現在の関心事とタスクに依存して変化する様々なアクションを加えてください。

source: Use drawing tools to combine shapes or define custom paths for shapes of your own design.
ja: 描画ツールを使って、形状を結合してください、またはあなた独自のデザインの形状のためにあつらえのパスを定義してください。

source: Use gesture modifiers to add interactivity to your app.
ja: ジェスチャ修飾子を使って相互作用機能をあなたのアプリに加えてください。

source: Use hue rotation effect to shift all of the colors in a view according to the angle you specify.
ja: 色相回転効果を使って、あるビューの中の色の全てをずらしてください、あなたが指定する角度に従って。

source: Use methods called modifiers to customize the display, behavior, and interactivity of built-in views and those you create for your app.
ja: 修飾子と呼ばれるメソッドを使うことで、組込みのビューそしてあなたがあなたのアプリのために作成するそれの表示、挙動、そして相互作用性をカスタマイズしてください。

source: Use modifiers like lineLimit(_:), allowsTightening(_:), minimumScaleFactor(_:), and truncationMode(_:) to configure how the view handles space constraints.
ja: lineLimit(_:)、allowsTightening(_:)、minimumScaleFactor(_:)、そしてtruncationMode(_:)のような修飾子を使って、どのようにビューが画面の制約を取り扱うかを構成設定してください。

source: Use negative kerning to tighten the spacing between characters.
ja: 負のカーニングを使って、文字間の空きを締めてください。

source: Use positive kerning to widen the spacing between characters.
ja: 正のカーニングを使って、文字間の空きを広くしてください。

source: Use stacks and lists to lay out the views of your user interface.
ja: スタックとリストを使って、あなたのユーザインターフェイスのビューそれらを配置してください。

source: Use the frame(width:height:alignment:) or the frame(minWidth:idealWidth:maxWidth:minHeight:idealHeight:maxHeight:alignment:) method instead.
ja: frame(width:height:alignment:)またはframe(minWidth:idealWidth:maxWidth:minHeight:idealHeight:maxHeight:alignment:)メソッドを代わりに使ってください。

source: Use the init(rootView:) method to create your hosting view instead.
ja: init(rootView:)メソッドを使って、あなたのホスティングビューを代わりに作成してください。

source: Use the truncationMode(_:) modifier with one of the Text.TruncationMode values to indicate which part of the text to truncate, either at the beginning, in the middle, or at the end.
ja: truncationMode(_:)修飾子をText.TruncationMode値のうちの１つとともに使って、テキストのどの部分を切り詰めるか指し示してください、冒頭で、真ん中において、または末尾でのどれか。

source: Use the transformedValue(_:) method to transform a value from one representation into another.
ja: transformedValue(_:)メソッドを使ってある値を１つの表現から別のものへと変換してください。

source: Use the clipped(antialiased:)modifier to hide any content that extends beyond these edges.
ja: clipped(antialiased:)修飾子を使って、それら縁を越えるあらゆる内容を隠してください。

source: Use the cornerRadius(_:antialiased:) modifier to hide any content that extends beyond these edges while applying a corner radius.
ja: cornerRadius(_:antialiased:)修飾子を使って、それら縁を越えるどんな内容も隠してください、角丸めを適用している間は。

source: Use the minimumScaleFactor(_:) modifier if the text you place in a view doesn’t fit and it’s okay if the text shrinks to accommodate.
ja: minimumScaleFactor(_:)修飾子を使ってください、もしあなたがビューの中に置くテキストがぴったり合わないそしてテキストが縮んで適合するなら問題ないならば。

source: Use the reduce(_:_:) method to produce a single value from the elements of an entire sequence.
ja: reduce(_:_:)メソッドを使って、あるシーケンス全体の中の要素から単一の値を生成してください。

source: Use the reduce(into:_:) method to produce a single value from the elements of an entire sequence.
ja: reduce(into:_:)メソッドを使って、あるシーケンス全体の要素から単一の値を生成してください。

source: Use the truncationMode(_:) modifier to determine whether text in a long line is truncated at the beginning, middle, or end.
ja: truncationMode(_:)修飾子を使って、ある長い行の中のテキストが始まり、真ん中、または終わりで切り詰められるかどうかを決定してください。

source: Use the clipped(antialiased:) modifier to hide any content that extends beyond the layout bounds of the shape.
ja: clipped(antialiased:)修飾子を使って、その形状のレイアウト境界を越えて広がるあらゆる内容を隠してください。

source: Use the trim(from:to:) method to draw a portion of a shape by ignoring portions of the beginning and ending of the shape’s path.
ja: trim(from:to:)メソッドを使って、ある形状（shape）の一部を描画してください、形状のもつパスの始まりと終わりの一部を無視することによって。

source: Use the closed range operator (...) to create a closed range of any type that conforms to the Comparable protocol.
ja: 完結範囲演算子（...）を使うことでComparableプロトコルに準拠する何らかの型の配列を作成してください。

source: Use the environment values to configure the state of your UIKit view controller when creating or updating it.
ja: 環境値を使って、あなたのUIKitビューコントローラの状態を構成設定してください、それを作成または更新する時に。

source: Use the environment values to configure the state of your interface object when creating or updating it.
ja: 環境値を使って、あなたのインターフェイスオブジェクトの状態を構成設定してください、それを作成または更新する時に。
